## Staging
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                   RESOURCE                    |
|----------|-----------------------------------------------|
| update   | `module.n8n_ecs.aws_ecs_service.this`         |
| recreate | `module.n8n_ecs.aws_ecs_task_definition.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.n8n_ecs.data.aws_ecs_task_definition.this_latest will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this_latest" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + region                   = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "n8n"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.n8n_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:517451398792:service/n8n/n8n"
        name                               = "n8n"
        tags                               = {
            "CostCentre" = "n8n-staging"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "n8n:9" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.n8n_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:517451398792:task-definition/n8n:9" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:517451398792:task-definition/n8n" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "n8nio/n8n:1.115.0@sha256:37b55505854e4f9ca840672c6e94abbe35cfba5fc63c750f2b3c470ca5529af4" -> "n8nio/n8n:1.115.2@sha256:ca7bc6b8de1b4f0f87e66d1fee70ddeafa4cc98989c361f7ec1a6c45bec04c96"
                    name                   = "n8n"
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "n8n" -> (known after apply)
      ~ revision                 = 9 -> (known after apply)
        tags                     = {
            "CostCentre" = "n8n-staging"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "n8n-data" -> null
            # (1 unchanged attribute hidden)

          - efs_volume_configuration {
              - file_system_id          = "fs-0da29fa0c24aac602" -> null
              - root_directory          = "/" -> null
              - transit_encryption      = "ENABLED" -> null
              - transit_encryption_port = 2049 -> null

              - authorization_config {
                  - access_point_id = "fsap-0eaf414423d98a7c3" -> null
                  - iam             = "ENABLED" -> null
                }
            }
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "n8n-data"
            # (1 unchanged attribute hidden)

          + efs_volume_configuration {
              + file_system_id          = "fs-0da29fa0c24aac602"
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 2049

              + authorization_config {
                  + access_point_id = "fsap-0eaf414423d98a7c3"
                  + iam             = "ENABLED"
                }
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/model_ecs.sentinel_forwarder/sentinel_forwarder/main.tf line 85, in resource "aws_lambda_permission" "sentinel_forwarder_cloudwatch_log_subscription":
  85:   principal     = "logs.${data.aws_region.current.name}.amazonaws.com"

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 4 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.model_ecs.aws_service_discovery_service.this,
  on .terraform/modules/model_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

